<?php

$a = "a";
$b = "b";
$c = "c";
$d = "d";
$e = "e";
$f = "f";
$g = "g";
$h = "h";
$i = "i";
$j = "j";
$k = "k";
$l = "l";
$m = "m";
$n = "n";
$o = "o";
$p = "p";
$q = "q";
$r = "r";
$s = "s";
$t = "t";
$u = "u";
$v = "v";
$w = "w";
$x = "x";
$y = "y";
$z = "z";




$ary = array("a", "b", "c", "d", "e", "f", "g", "h", "i", "j", "k", "l", "m", "n", "o", "p", "q", "r", "s", "t", "u", "v", "w", "x", "y", "z");




$ary = array(
    "a", "b", "c", "d", "e",
    "f", "g", "h", "i", "j",
    "k", "l", "m", "n", "o",
    "p", "q", "r", "s", "t",
    "u", "v", "w", "x", "y", "z"
   );




$ary = array();




$ary = array(1, 2, 3);




// echoは数値や文字を出力する処理だよ
$str = "今日はいい天気だね";  // 変数に文字列を代入
echo $str;                 // 変数の値を出力

// 配列を用意
$ary = array(1, 2, 3);

// 配列の0番目の要素を出力
echo $ary[0];




// 配列を用意
// 要素番号0：おはよう
// 要素番号1：こんにちわ
// 要素番号2：こんばんわ
// 要素番号3：おやすみ
$ary = array("おはよう", "こんにちわ", "こんばんわ", "おやすみ");

// 配列からおはようを取り出して出力する
echo $ary[0];

// 配列からこんにちわを取り出して出力する
echo $ary[1];

// 配列からこんばんわを取り出して出力する
echo $ary[2];

// 配列からおやすみを取り出して出力する
echo $ary[3];




// 配列に数値、文字列、論理、配列を入れる
$ary = array(123, "こんにちわ", true, array(1, "Hello", false));

?>